In [ ]:
import pandas as pd
import numpy as np
import os 
import datetime

In [2]:
file1 = "Resources/Seattle_calendar1.xlsx"
seattle_df1 = pd.read_excel(file1)
seattle_df1.head()

   listing_id       date available  price
0      241032 2016-01-04         t   85.0
1      241032 2016-01-05         t   85.0
2      241032 2016-01-06         f    NaN
3      241032 2016-01-07         f    NaN
4      241032 2016-01-08         f    NaN

In [3]:
seattle_df1 = seattle_df1.dropna(how="any")
seattle_df1.count()

listing_id    348432
date          348432
available     348432
price         348432
dtype: int64

In [5]:
file2 = "Resources/Seattle_calendar2.xlsx"
seattle_df2 = pd.read_excel(file2)
seattle_df2.head()

   listing_id       date available  price
0     6850007 2016-10-18         t  130.0
1     6850007 2016-10-19         t  130.0
2     6850007 2016-10-20         t  130.0
3     6850007 2016-10-21         t  130.0
4     6850007 2016-10-22         t  130.0

In [7]:
seattle_df2 = seattle_df2.dropna(how="any")
seattle_df2.count()

listing_id    351430
date          351430
available     351430
price         351430
dtype: int64

In [8]:
df_final_seattle = pd.concat([seattle_df1, seattle_df2])

df_final_seattle.count()

listing_id    699862
date          699862
available     699862
price         699862
dtype: int64

In [9]:
df_final_seattle.head()

    listing_id       date available  price
0       241032 2016-01-04         t   85.0
1       241032 2016-01-05         t   85.0
9       241032 2016-01-13         t   85.0
10      241032 2016-01-14         t   85.0
14      241032 2016-01-18         t   85.0

In [10]:
df_final_seattle['year'] = df_final_seattle['date'].dt.year
df_final_seattle.head()

    listing_id       date available  price  year
0       241032 2016-01-04         t   85.0  2016
1       241032 2016-01-05         t   85.0  2016
9       241032 2016-01-13         t   85.0  2016
10      241032 2016-01-14         t   85.0  2016
14      241032 2016-01-18         t   85.0  2016

In [11]:
df_final_seattle['Location'] = 'Seattle'
df_final_seattle.head()

    listing_id       date available  price  year Location
0       241032 2016-01-04         t   85.0  2016  Seattle
1       241032 2016-01-05         t   85.0  2016  Seattle
9       241032 2016-01-13         t   85.0  2016  Seattle
10      241032 2016-01-14         t   85.0  2016  Seattle
14      241032 2016-01-18         t   85.0  2016  Seattle

In [12]:
# df_final_boston['Month'] = df_final_boston['date'].dt.month
df_final_seattle.count()

listing_id    699862
date          699862
available     699862
price         699862
year          699862
Location      699862
dtype: int64

In [50]:
Yearly = df_final_boston.groupby('year')
avgPrice = df_final_boston['price'].mean()

yearly_df = pd.DataFrame({'Year': Yearly,
                         'Average Price': avgPrice})
yearly_df

ValueError: If using all scalar values, you must pass an index